[Killed] ArithmeticOperator
src/ast.js:7:39
 let indentSize = 2;
 
 //Helper functions
-let getIndentStr = level => new Array(indentSize * level).join(' ');
+let getIndentStr = level => new Array(indentSize / level).join(' ');
 let indentNode = level => new SourceNode(null, null, null, getIndentStr(level));
 
killedBy: arithmetics should function when a variable is declared
statusReason: Invalid array length

[Survived] ArrowFunction
src/ast.js:7:20
 let indentSize = 2;
 
 //Helper functions
-let getIndentStr = level => new Array(indentSize * level).join(' ');
+let getIndentStr = () => undefined;
 let indentNode = level => new SourceNode(null, null, null, getIndentStr(level));
 

[Killed] ArrowFunction
src/ast.js:8:18
 
 //Helper functions
 let getIndentStr = level => new Array(indentSize * level).join(' ');
-let indentNode = level => new SourceNode(null, null, null, getIndentStr(level));
+let indentNode = () => undefined;
 
 //Base class
killedBy: arithmetics should function when a variable is declared
statusReason: Cannot read properties of undefined (reading '$$$isSourceNode$$$')

[Killed] BlockStatement
src/ast.js:12:29
 
 //Base class
 class AstNode {
-  constructor(line, column) {
-    this.line = line;
-    this.column = column;
-  }
+  constructor(line, column) {}
   _sn(indent, fileName, chunk) {
     return new SourceNode(this.line, this.column, fileName, '')
killedBy: arithmetics should function when a variable is declared
statusReason: [] == "IT'S SHOWTIME\r\n" +
  'HEY CHRISTMAS TREE var1\r\n' +
  'YOU SET US UP 123\r\n' +
  'YOU HAVE BEEN TERMINATED\r\n'

[Killed] BlockStatement
src/ast.js:16:32
     this.line = line;
     this.column = column;
   }
-  _sn(indent, fileName, chunk) {
-    return new SourceNode(this.line, this.column, fileName, '')
-      .add(indentNode(indent))
-      .add(chunk);
-  }
+  _sn(indent, fileName, chunk) {}
   compile(indent, fileName) {
     //Abstract
killedBy: arithmetics should function when a variable is declared
statusReason: Cannot read properties of undefined (reading 'add')

[Killed] BlockStatement
src/ast.js:29:32
 //Keywords/Expressions
 
 class PrintExpression extends AstNode {
-  constructor(position, value) {
-    super(position.first_line, position.first_column);
-    this.value = value;
-  }
+  constructor(position, value) {}
   compile(indent, fileName) {
     return this._sn(indent, fileName, 'console.log( ')
killedBy: arithmetics should function when an integer is printed
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] BlockStatement
src/ast.js:33:29
     super(position.first_line, position.first_column);
     this.value = value;
   }
-  compile(indent, fileName) {
-    return this._sn(indent, fileName, 'console.log( ')
-      .add(this.value.compile(indent, fileName))
-      .add(' );\n');
-  }
+  compile(indent, fileName) {}
 }
 
killedBy: arithmetics should function when an integer is printed
statusReason: Cannot read properties of undefined (reading '$$$isSourceNode$$$')

[Killed] BlockStatement
src/ast.js:41:38
 }
 
 class IntDeclarationExpression extends AstNode {
-  constructor(position, name, value) {
-    super(position.first_line, position.first_column);
-    this.name = name;
-    this.value = value;
-  }
+  constructor(position, name, value) {}
 
   compile(indent, fileName) {
killedBy: arithmetics should function when a variable is declared
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] BlockStatement
src/ast.js:47:29
     this.value = value;
   }
 
-  compile(indent, fileName) {
-    var node = this._sn(indent, fileName, '');
-    var val = this.value.compile ? this.value.compile(0, fileName) : this.value;
-    node.add('var ')
-      .add(this.name.compile(indent, fileName))
-      .add(' = ')
-      .add(val);
-    return node.add(';\n');
-  }
+  compile(indent, fileName) {}
 }
 
killedBy: arithmetics should function when a variable is declared
statusReason: Cannot read properties of undefined (reading '$$$isSourceNode$$$')

[Killed] StringLiteral
src/ast.js:50:14
   compile(indent, fileName) {
     var node = this._sn(indent, fileName, '');
     var val = this.value.compile ? this.value.compile(0, fileName) : this.value;
-    node.add('var ')
+    node.add("")
       .add(this.name.compile(indent, fileName))
       .add(' = ')
killedBy: arithmetics should function when a variable is declared
statusReason: var1 is not defined

[Killed] BlockStatement
src/ast.js:59:57
 }
 
 class AssignmentExpression extends AstNode {
-  constructor(position, name, initialValue, operations) {
-    super(position.first_line, position.first_column);
-    this.name = name;
-    this.initialValue = initialValue;
-    this.operations = operations;
-  }
+  constructor(position, name, initialValue, operations) {}
 
   compile(indent, fileName) {
killedBy: arithmetics should evaluate when assigning a variable
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] BlockStatement
src/ast.js:72:56
       .add(compiledName)
       .add(' = (');
 
-    if (this.operations && this.operations.length > 0) {
-      var opsNodes = [this.initialValue.compile(indent, fileName)];
-      this.operations.forEach(function (operation) {
-        opsNodes.splice(0, 0, '(');
-        opsNodes.push(operation.compile(indent, fileName));
-        opsNodes.push(')');
-      });
-      node.add(opsNodes)
-        .add(');\n');
-    } else {
+    if (this.operations && this.operations.length > 0) {} else {
       node.add(this.initialValue.compile(indent, fileName))
         .add(');\n');
killedBy: arithmetics should evaluate when assigning multiple variables
statusReason: Unexpected token 'if'

[Survived] EqualityOperator
src/ast.js:72:28
       .add(compiledName)
       .add(' = (');
 
-    if (this.operations && this.operations.length > 0) {
+    if (this.operations && this.operations.length >= 0) {
       var opsNodes = [this.initialValue.compile(indent, fileName)];
       this.operations.forEach(function (operation) {

[Killed] ArrayDeclaration
src/ast.js:73:22
       .add(' = (');
 
     if (this.operations && this.operations.length > 0) {
-      var opsNodes = [this.initialValue.compile(indent, fileName)];
+      var opsNodes = [];
       this.operations.forEach(function (operation) {
         opsNodes.splice(0, 0, '(');
killedBy: arithmetics should evaluate when multiplying variables
statusReason: Unexpected token '*'

[Survived] BlockStatement
src/ast.js:74:52
 
     if (this.operations && this.operations.length > 0) {
       var opsNodes = [this.initialValue.compile(indent, fileName)];
-      this.operations.forEach(function (operation) {
-        opsNodes.splice(0, 0, '(');
-        opsNodes.push(operation.compile(indent, fileName));
-        opsNodes.push(')');
-      });
+      this.operations.forEach(function (operation) {});
       node.add(opsNodes)
         .add(');\n');

[Killed] StringLiteral
src/ast.js:77:23
       this.operations.forEach(function (operation) {
         opsNodes.splice(0, 0, '(');
         opsNodes.push(operation.compile(indent, fileName));
-        opsNodes.push(')');
+        opsNodes.push("");
       });
       node.add(opsNodes)
killedBy: arithmetics should evaluate when assigning multiple variables
statusReason: Unexpected token ';'

[Killed] BlockStatement
src/ast.js:81:12
       });
       node.add(opsNodes)
         .add(');\n');
-    } else {
-      node.add(this.initialValue.compile(indent, fileName))
-        .add(');\n');
-    }
+    } else {}
     node.add(indentNode(indent))
       .add('if(typeof(')
killedBy: arithmetics should evaluate when assigning a variable
statusReason: Unexpected token 'if'

[Survived] StringLiteral
src/ast.js:90:12
       .add(compiledName)
       .add(') === "boolean") { ')
       .add(compiledName)
-      .add(' = ')
+      .add("")
       .add(compiledName)
       .add(' ? 1 : 0; }\n')

[Killed] StringLiteral
src/ast.js:92:12
       .add(compiledName)
       .add(' = ')
       .add(compiledName)
-      .add(' ? 1 : 0; }\n')
+      .add("")
       .add(indentNode(indent))
       .add(compiledName)
killedBy: arithmetics should evaluate when assigning a variable
statusReason: Unexpected identifier

[Killed] StringLiteral
src/ast.js:95:12
       .add(' ? 1 : 0; }\n')
       .add(indentNode(indent))
       .add(compiledName)
-      .add(' = Math.round(')
+      .add("")
       .add(compiledName)
       .add(');\n');
killedBy: arithmetics should evaluate when assigning a variable
statusReason: Unexpected token ')'

[Killed] BlockStatement
src/ast.js:104:89
 }
 
 class IfExpression extends AstNode {
-  constructor(position, predicate, ifStatements, elseStatements, endPosition, elseNode) {
-    super(position.first_line, position.first_column);
-    this.predicate = predicate;
-    this.ifStatements = ifStatements;
-    this.elseStatements = elseStatements;
-    this.endIfLine = endPosition.first_line;
-    this.endIfColumn = endPosition.first_column;
-    this.elseNode = elseNode;
-  }
+  constructor(position, predicate, ifStatements, elseStatements, endPosition, elseNode) {}
 
   compile(indent, fileName) {
killedBy: branches should function with an if statement
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] BlockStatement
src/ast.js:114:29
     this.elseNode = elseNode;
   }
 
-  compile(indent, fileName) {
-    var expr = this._sn(indent, fileName, 'if (')
-      .add(this.predicate.compile(indent, fileName))
-      .add(') { \n');
-
-    expr.add(this.ifStatements.map(function (node) {
-      return node.compile(indent + 1, fileName);
-    }));
-
-    if (this.elseStatements && this.elseStatements.length > 0) {
-      expr.add(indentNode(indent))
-        .add('}\n')
-        .add(this.elseNode.compile(indent, fileName))
-        .add(this.elseStatements.map(function (node) {
-          return node.compile(indent + 1, fileName);
-        }));
-    }
-    return expr.add(indentNode(indent))
-      .add(new SourceNode(this.endIfLine, this.endIfColumn, fileName, '}\n'));
-  }
+  compile(indent, fileName) {}
 }
 
killedBy: branches should function with an if statement
statusReason: Cannot read properties of undefined (reading '$$$isSourceNode$$$')

[Killed] StringLiteral
src/ast.js:117:12
   compile(indent, fileName) {
     var expr = this._sn(indent, fileName, 'if (')
       .add(this.predicate.compile(indent, fileName))
-      .add(') { \n');
+      .add("");
 
     expr.add(this.ifStatements.map(function (node) {
killedBy: branches should function with an if statement
statusReason: Unexpected identifier

[Killed] BlockStatement
src/ast.js:119:52
       .add(this.predicate.compile(indent, fileName))
       .add(') { \n');
 
-    expr.add(this.ifStatements.map(function (node) {
-      return node.compile(indent + 1, fileName);
-    }));
+    expr.add(this.ifStatements.map(function (node) {}));
 
     if (this.elseStatements && this.elseStatements.length > 0) {
killedBy: branches should function with an if statement
statusReason: Cannot read properties of undefined (reading '$$$isSourceNode$$$')

[Survived] ArithmeticOperator
src/ast.js:120:27
       .add(') { \n');
 
     expr.add(this.ifStatements.map(function (node) {
-      return node.compile(indent + 1, fileName);
+      return node.compile(indent - 1, fileName);
     }));
 

[Killed] EqualityOperator
src/ast.js:123:32
       return node.compile(indent + 1, fileName);
     }));
 
-    if (this.elseStatements && this.elseStatements.length > 0) {
+    if (this.elseStatements && this.elseStatements.length >= 0) {
       expr.add(indentNode(indent))
         .add('}\n')
killedBy: branches should function with an if statement
statusReason: Cannot read properties of undefined (reading 'compile')

[Killed] ConditionalExpression
src/ast.js:123:9
       return node.compile(indent + 1, fileName);
     }));
 
-    if (this.elseStatements && this.elseStatements.length > 0) {
+    if (true) {
       expr.add(indentNode(indent))
         .add('}\n')
killedBy: branches should function with an if statement
statusReason: Cannot read properties of undefined (reading 'compile')

[Killed] BlockStatement
src/ast.js:127:54
       expr.add(indentNode(indent))
         .add('}\n')
         .add(this.elseNode.compile(indent, fileName))
-        .add(this.elseStatements.map(function (node) {
-          return node.compile(indent + 1, fileName);
-        }));
+        .add(this.elseStatements.map(function (node) {}));
     }
     return expr.add(indentNode(indent))
killedBy: branches should function with if and else statements
statusReason: Cannot read properties of undefined (reading '$$$isSourceNode$$$')

[Survived] ArithmeticOperator
src/ast.js:128:31
         .add('}\n')
         .add(this.elseNode.compile(indent, fileName))
         .add(this.elseStatements.map(function (node) {
-          return node.compile(indent + 1, fileName);
+          return node.compile(indent - 1, fileName);
         }));
     }

[Killed] StringLiteral
src/ast.js:132:71
         }));
     }
     return expr.add(indentNode(indent))
-      .add(new SourceNode(this.endIfLine, this.endIfColumn, fileName, '}\n'));
+      .add(new SourceNode(this.endIfLine, this.endIfColumn, fileName, ""));
   }
 }
killedBy: branches should function with an if statement
statusReason: Unexpected token ')'

[Killed] BlockStatement
src/ast.js:137:29
 }
 
 class ElseNode extends AstNode {
-  constructor(line, column) {
-    super(line, column);
-  }
+  constructor(line, column) {}
 
   compile(indent, fileName) {
killedBy: branches should function with if and else statements
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] BlockStatement
src/ast.js:141:29
     super(line, column);
   }
 
-  compile(indent, fileName) {
-    return this._sn(indent, fileName, 'else { \n');
-  }
+  compile(indent, fileName) {}
 }
 
killedBy: branches should function with if and else statements
statusReason: Cannot read properties of undefined (reading '$$$isSourceNode$$$')

[Killed] StringLiteral
src/ast.js:142:39
   }
 
   compile(indent, fileName) {
-    return this._sn(indent, fileName, 'else { \n');
+    return this._sn(indent, fileName, "");
   }
 }
killedBy: branches should function with if and else statements
statusReason: Unexpected token '}'

[NoCoverage] BlockStatement
src/ast.js:147:66
 }
 
 class WhileExpression extends AstNode {
-  constructor(position, predicate, whileStatements, endPosition) {
-    super(position.first_line, position.first_column);
-    this.predicate = predicate;
-    this.whileStatements = whileStatements;
-    this.endLine = endPosition.first_line;
-    this.endColumn = endPosition.first_column;
-  }
+  constructor(position, predicate, whileStatements, endPosition) {}
 
   compile(indent, fileName) {

[NoCoverage] BlockStatement
src/ast.js:155:29
     this.endColumn = endPosition.first_column;
   }
 
-  compile(indent, fileName) {
-    return this._sn(indent, fileName, 'while (')
-      .add(this.predicate.compile(indent, fileName))
-      .add(') {\n')
-      .add(this.whileStatements.map(function (statement) {
-        return statement.compile(indent + 1, fileName);
-      }))
-      .add(indentNode(indent))
-      .add(new SourceNode(this.endLine, this.endColumn, fileName, '}\n'));
-  }
+  compile(indent, fileName) {}
 }
 

[NoCoverage] StringLiteral
src/ast.js:156:39
   }
 
   compile(indent, fileName) {
-    return this._sn(indent, fileName, 'while (')
+    return this._sn(indent, fileName, "")
       .add(this.predicate.compile(indent, fileName))
       .add(') {\n')

[NoCoverage] StringLiteral
src/ast.js:158:12
   compile(indent, fileName) {
     return this._sn(indent, fileName, 'while (')
       .add(this.predicate.compile(indent, fileName))
-      .add(') {\n')
+      .add("")
       .add(this.whileStatements.map(function (statement) {
         return statement.compile(indent + 1, fileName);

[NoCoverage] BlockStatement
src/ast.js:159:58
     return this._sn(indent, fileName, 'while (')
       .add(this.predicate.compile(indent, fileName))
       .add(') {\n')
-      .add(this.whileStatements.map(function (statement) {
-        return statement.compile(indent + 1, fileName);
-      }))
+      .add(this.whileStatements.map(function (statement) {}))
       .add(indentNode(indent))
       .add(new SourceNode(this.endLine, this.endColumn, fileName, '}\n'));

[NoCoverage] ArithmeticOperator
src/ast.js:160:34
       .add(this.predicate.compile(indent, fileName))
       .add(') {\n')
       .add(this.whileStatements.map(function (statement) {
-        return statement.compile(indent + 1, fileName);
+        return statement.compile(indent - 1, fileName);
       }))
       .add(indentNode(indent))

[NoCoverage] StringLiteral
src/ast.js:163:67
         return statement.compile(indent + 1, fileName);
       }))
       .add(indentNode(indent))
-      .add(new SourceNode(this.endLine, this.endColumn, fileName, '}\n'));
+      .add(new SourceNode(this.endLine, this.endColumn, fileName, ""));
   }
 }

[NoCoverage] BlockStatement
src/ast.js:169:78
 
 
 class MethodDeclarationExpression extends AstNode {
-  constructor(line, column, name, args, innerStatements, endLine, endColumn) {
-    super(line, column);
-    this.name = name;
-    this.args = args;
-    this.innerStatements = innerStatements;
-    this.endLine = endLine;
-    this.endColumn = endColumn;
-  }
+  constructor(line, column, name, args, innerStatements, endLine, endColumn) {}
 
   compile(indent, fileName) {

[NoCoverage] BlockStatement
src/ast.js:178:29
     this.endColumn = endColumn;
   }
 
-  compile(indent, fileName) {
-    var node = this._sn(indent, fileName, 'function ')
-      .add(this.name.compile(indent, fileName))
-      .add(' (');
-
-
-    this.args.forEach(function (argument, i, self) {
-      node.add(argument.compile(0, fileName));
-      if (i != self.length - 1) {
-        node.add(', ');
-      }
-    });
-
-    return node.add(') {\n')
-      .add(this.innerStatements.map(function (statement) {
-        return statement.compile(indent + 1, fileName);
-      }))
-      .add(indentNode(indent))
-      .add(new SourceNode(this.endLine, this.endColumn, fileName, '}\n'));
-  }
+  compile(indent, fileName) {}
 }
 

[NoCoverage] StringLiteral
src/ast.js:179:43
   }
 
   compile(indent, fileName) {
-    var node = this._sn(indent, fileName, 'function ')
+    var node = this._sn(indent, fileName, "")
       .add(this.name.compile(indent, fileName))
       .add(' (');

[NoCoverage] BlockStatement
src/ast.js:184:52
       .add(' (');
 
 
-    this.args.forEach(function (argument, i, self) {
-      node.add(argument.compile(0, fileName));
-      if (i != self.length - 1) {
-        node.add(', ');
-      }
-    });
+    this.args.forEach(function (argument, i, self) {});
 
     return node.add(') {\n')

[NoCoverage] ConditionalExpression
src/ast.js:186:11
 
     this.args.forEach(function (argument, i, self) {
       node.add(argument.compile(0, fileName));
-      if (i != self.length - 1) {
+      if (true) {
         node.add(', ');
       }

[NoCoverage] BlockStatement
src/ast.js:186:33
 
     this.args.forEach(function (argument, i, self) {
       node.add(argument.compile(0, fileName));
-      if (i != self.length - 1) {
-        node.add(', ');
-      }
+      if (i != self.length - 1) {}
     });
 

[NoCoverage] BlockStatement
src/ast.js:192:58
     });
 
     return node.add(') {\n')
-      .add(this.innerStatements.map(function (statement) {
-        return statement.compile(indent + 1, fileName);
-      }))
+      .add(this.innerStatements.map(function (statement) {}))
       .add(indentNode(indent))
       .add(new SourceNode(this.endLine, this.endColumn, fileName, '}\n'));

[NoCoverage] ArithmeticOperator
src/ast.js:193:34
 
     return node.add(') {\n')
       .add(this.innerStatements.map(function (statement) {
-        return statement.compile(indent + 1, fileName);
+        return statement.compile(indent - 1, fileName);
       }))
       .add(indentNode(indent))

[NoCoverage] BlockStatement
src/ast.js:202:37
 
 
 class CallExpression extends AstNode {
-  constructor(position, name, args) {
-    super(position.first_line, position.first_column);
-    this.name = name;
-    this.args = args;
-  }
+  constructor(position, name, args) {}
 
   compile(indent, fileName) {

[NoCoverage] BlockStatement
src/ast.js:208:29
     this.args = args;
   }
 
-  compile(indent, fileName) {
-    var node = this._sn(indent, fileName, '')
-      .add(this.name.compile(indent, fileName))
-      .add('(');
-
-    this.args.forEach(function (argument, i, self) {
-      node.add(argument.compile(indent, fileName));
-      if (i != self.length - 1) {
-        node.add(', ');
-      }
-    });
-    node.add(');\n');
-    return node;
-  }
+  compile(indent, fileName) {}
 }
 

[NoCoverage] StringLiteral
src/ast.js:211:12
   compile(indent, fileName) {
     var node = this._sn(indent, fileName, '')
       .add(this.name.compile(indent, fileName))
-      .add('(');
+      .add("");
 
     this.args.forEach(function (argument, i, self) {

[NoCoverage] BlockStatement
src/ast.js:213:52
       .add(this.name.compile(indent, fileName))
       .add('(');
 
-    this.args.forEach(function (argument, i, self) {
-      node.add(argument.compile(indent, fileName));
-      if (i != self.length - 1) {
-        node.add(', ');
-      }
-    });
+    this.args.forEach(function (argument, i, self) {});
     node.add(');\n');
     return node;

[NoCoverage] BlockStatement
src/ast.js:215:33
 
     this.args.forEach(function (argument, i, self) {
       node.add(argument.compile(indent, fileName));
-      if (i != self.length - 1) {
-        node.add(', ');
-      }
+      if (i != self.length - 1) {}
     });
     node.add(');\n');

[NoCoverage] EqualityOperator
src/ast.js:215:11
 
     this.args.forEach(function (argument, i, self) {
       node.add(argument.compile(indent, fileName));
-      if (i != self.length - 1) {
+      if (i == self.length - 1) {
         node.add(', ');
       }

[NoCoverage] BlockStatement
src/ast.js:225:32
 }
 
 class ReturnExpression extends AstNode {
-  constructor(position, value) {
-    super(position.first_line, position.first_column);
-    this.value = value;
-  }
+  constructor(position, value) {}
 
   compile(indent, fileName) {

[NoCoverage] BlockStatement
src/ast.js:230:29
     this.value = value;
   }
 
-  compile(indent, fileName) {
-    return this._sn(indent, fileName, 'return ')
-      .add(this.value.compile(indent, fileName))
-      .add(';\n');
-  }
+  compile(indent, fileName) {}
 }
 

[Killed] BlockStatement
src/ast.js:238:38
 }
 
 class IntegerLike extends AstNode {
-  constructor(line, column, boolVal) {
-    super(line, column);
-    this.boolVal = boolVal;
-  }
+  constructor(line, column, boolVal) {}
 
   compile(indent, fileName) {
killedBy: arithmetics should function when a variable is declared
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] BlockStatement
src/ast.js:243:29
     this.boolVal = boolVal;
   }
 
-  compile(indent, fileName) {
-    return this._sn(0, fileName, this.boolVal);
-  }
+  compile(indent, fileName) {}
 }
 
killedBy: arithmetics should function when a variable is declared
statusReason: Cannot read properties of undefined (reading '$$$isSourceNode$$$')

[Killed] BlockStatement
src/ast.js:249:46
 }
 
 class Operation extends AstNode {
-  constructor(position, operation, variable) {
-    super(position.first_line, position.first_column);
-    this.operation = operation;
-    this.variable = variable;
-  }
+  constructor(position, operation, variable) {}
 
   compile(indent, fileName) {
killedBy: arithmetics should evaluate when assigning multiple variables
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] BlockStatement
src/ast.js:255:29
     this.variable = variable;
   }
 
-  compile(indent, fileName) {
-    return this._sn(0, fileName, '')
-      .add(this.operation)
-      .add(this.variable.compile(indent, fileName));
-  }
+  compile(indent, fileName) {}
 }
 
killedBy: arithmetics should evaluate when assigning multiple variables
statusReason: Cannot read properties of undefined (reading '$$$isSourceNode$$$')

[Killed] StringLiteral
src/ast.js:256:34
   }
 
   compile(indent, fileName) {
-    return this._sn(0, fileName, '')
+    return this._sn(0, fileName, "Stryker was here!")
       .add(this.operation)
       .add(this.variable.compile(indent, fileName));
killedBy: arithmetics should evaluate when assigning multiple variables
statusReason: Unexpected identifier

[NoCoverage] BlockStatement
src/ast.js:263:47
 }
 
 class AssignmentFromCallExpression extends AstNode {
-  constructor(position, name, functionCalled) {
-    super(position.first_line, position.first_column);
-    this.name = name;
-    this.functionCalled = functionCalled;
-  }
+  constructor(position, name, functionCalled) {}
 
   compile(indent, fileName) {

[NoCoverage] BlockStatement
src/ast.js:269:29
     this.functionCalled = functionCalled;
   }
 
-  compile(indent, fileName) {
-    return this._sn(indent, fileName, 'var ')
-      .add(this.name.compile(indent, fileName))
-      .add(' = ')
-      .add(this.functionCalled.compile(0, fileName));
-  }
+  compile(indent, fileName) {}
 }
 

[NoCoverage] StringLiteral
src/ast.js:270:39
   }
 
   compile(indent, fileName) {
-    return this._sn(indent, fileName, 'var ')
+    return this._sn(indent, fileName, "")
       .add(this.name.compile(indent, fileName))
       .add(' = ')

[NoCoverage] StringLiteral
src/ast.js:272:12
   compile(indent, fileName) {
     return this._sn(indent, fileName, 'var ')
       .add(this.name.compile(indent, fileName))
-      .add(' = ')
+      .add("")
       .add(this.functionCalled.compile(0, fileName));
   }

[NoCoverage] BlockStatement
src/ast.js:278:39
 }
 
 class ArgumentDeclarationExpression extends AstNode {
-  constructor(line, column, variable) {
-    super(line, column);
-    this.variable = variable;
-  }
+  constructor(line, column, variable) {}
 
   compile(indent, fileName) {

[NoCoverage] BlockStatement
src/ast.js:283:29
     this.variable = variable;
   }
 
-  compile(indent, fileName) {
-    return this._sn(indent, fileName, '')
-      .add(this.variable.compile(indent, fileName));
-  }
+  compile(indent, fileName) {}
 }
 

[Killed] BlockStatement
src/ast.js:290:55
 }
 
 class MainExpression extends AstNode {
-  constructor(statements, startPosition, endPosition) {
-    super(startPosition.first_line, startPosition.first_column);
-    this.statements = statements;
-    this.endLine = endPosition.first_line;
-    this.endColumn = endPosition.first_column;
-  }
+  constructor(statements, startPosition, endPosition) {}
 
   compile(indent, fileName) {
killedBy: arithmetics should function when a variable is declared
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] BlockStatement
src/ast.js:297:29
     this.endColumn = endPosition.first_column;
   }
 
-  compile(indent, fileName) {
-    return this._sn(indent, fileName, '')
-      .add(this.statements.map(function (child) {
-        return child.compile(indent + 1, fileName);
-      }));
-  }
+  compile(indent, fileName) {}
 }
 
killedBy: arithmetics should function when a variable is declared
statusReason: Cannot read properties of undefined (reading '$$$isSourceNode$$$')

[Killed] StringLiteral
src/ast.js:298:39
   }
 
   compile(indent, fileName) {
-    return this._sn(indent, fileName, '')
+    return this._sn(indent, fileName, "Stryker was here!")
       .add(this.statements.map(function (child) {
         return child.compile(indent + 1, fileName);
killedBy: arithmetics should function when a variable is declared
statusReason: Unexpected identifier

[Killed] BlockStatement
src/ast.js:299:49
 
   compile(indent, fileName) {
     return this._sn(indent, fileName, '')
-      .add(this.statements.map(function (child) {
-        return child.compile(indent + 1, fileName);
-      }));
+      .add(this.statements.map(function (child) {}));
   }
 }
killedBy: arithmetics should function when a variable is declared
statusReason: Cannot read properties of undefined (reading '$$$isSourceNode$$$')

[Survived] ArithmeticOperator
src/ast.js:300:30
   compile(indent, fileName) {
     return this._sn(indent, fileName, '')
       .add(this.statements.map(function (child) {
-        return child.compile(indent + 1, fileName);
+        return child.compile(indent - 1, fileName);
       }));
   }
