[Killed] BlockStatement
src/Transpiler.js:13:49
 
 const SourceNode = sourceMap.SourceNode;
 
-var withSourceMaps = function (nodes, fileName) {
-  var preamble = new SourceNode(null, null, null, '')
-    .add('(function() {\n "use strict";\n');
-
-  var codes = nodes.forEach(function (expr) {
-    preamble.add(expr.compile(1, fileName));
-  });
-
-  var postscript = new SourceNode(null, null, null, '')
-    .add('}());');
-
-  preamble.add(postscript);
-
-  return preamble;
-};
+var withSourceMaps = function (nodes, fileName) {};
 
 var transpile = function (source, fileName) {
killedBy: arithmetics should function when a variable is declared
statusReason: Cannot read properties of undefined (reading 'setSourceContent')

[Killed] BlockStatement
src/Transpiler.js:17:45
   var preamble = new SourceNode(null, null, null, '')
     .add('(function() {\n "use strict";\n');
 
-  var codes = nodes.forEach(function (expr) {
-    preamble.add(expr.compile(1, fileName));
-  });
+  var codes = nodes.forEach(function (expr) {});
 
   var postscript = new SourceNode(null, null, null, '')
killedBy: arithmetics should function when a variable is declared
statusReason: [] == "IT'S SHOWTIME\r\n" +
  'HEY CHRISTMAS TREE var1\r\n' +
  'YOU SET US UP 123\r\n' +
  'YOU HAVE BEEN TERMINATED\r\n'

[Killed] BlockStatement
src/Transpiler.js:29:45
   return preamble;
 };
 
-var transpile = function (source, fileName) {
-  var bnf = fs.readFileSync(path.join(__dirname, './arnoldc.jison'), 'utf-8');
-  var parser = new jison.Parser(bnf);
-  parser.yy = Parser;
-  var AST = parser.parse(source);
-
-  var mapping = withSourceMaps(AST, fileName);
-  mapping.setSourceContent(fileName, source);
-  return mapping;
-};
+var transpile = function (source, fileName) {};
 
 export { transpile, withSourceMaps };
killedBy: arithmetics should function when a variable is declared
statusReason: Cannot read properties of undefined (reading 'toStringWithSourceMap')

[Killed] StringLiteral
src/Transpiler.js:30:70
 };
 
 var transpile = function (source, fileName) {
-  var bnf = fs.readFileSync(path.join(__dirname, './arnoldc.jison'), 'utf-8');
+  var bnf = fs.readFileSync(path.join(__dirname, './arnoldc.jison'), "");
   var parser = new jison.Parser(bnf);
   parser.yy = Parser;
killedBy: arithmetics should function when a variable is declared
statusReason: Grammar error: must have at least one rule.
